{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "dc5d878d",
   "metadata": {},
   "source": [
    "# 5. 5. Konsumenta B, który zapisuje wiadomości do bazy Neo4j jako dwa grafy:\n",
    "a) (User)-[:USES]->(Device) # Użytkownik używa urządzenia\n",
    "\n",
    "b) (User)-[:TRANSFER]->(User) # Użytkownik A wykonał transfer do użytkownika B\n",
    "z właściwościami:\n",
    "- amount\n",
    "- timestamp\n",
    "- title"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d2062cba",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os, sys\n",
    "import json\n",
    "import pandas as pd\n",
    "from kafka import KafkaConsumer\n",
    "from neo4j import GraphDatabase\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "95021445",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "consumer = KafkaConsumer(\n",
    "    'transactions',\n",
    "    bootstrap_servers='reda_kafka_lab:9092',\n",
    "    auto_offset_reset='earliest',\n",
    "    enable_auto_commit=True,\n",
    "    group_id='neo4j-group',\n",
    "    value_deserializer=lambda m: json.loads(m.decode('utf-8'))\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "27c71fa9",
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_cypher(driver, query: str):\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query)\n",
    "        records = list(result)\n",
    "        \n",
    "        if not records:\n",
    "            print(\"Brak wyników.\")\n",
    "            return\n",
    "        \n",
    "        df = pd.DataFrame([r.data() for r in records])\n",
    "        return df\n",
    "\n",
    "\n",
    "def qexec(query: str):\n",
    "    driver = GraphDatabase.driver(URI, auth=(USERNAME, PASSWORD))\n",
    "    \n",
    "    try:\n",
    "        df = run_cypher(driver, query)\n",
    "    finally:\n",
    "        driver.close()\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0213c1ad",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Połączenie z Neo4j\n",
    "URI = \"bolt://reda_neo4j_lab:7687\"\n",
    "USERNAME = \"neo4j\"\n",
    "PASSWORD = \"test1234\"  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8cff30f5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Brak wyników.\n"
     ]
    }
   ],
   "source": [
    "#wyczysc wszystkie dane\n",
    "query = \"\"\"\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "\"\"\"\n",
    "\n",
    "qexec(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "148a2dad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodes_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodes_count\n",
       "0            0"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#sprawdz czy baza jest czysta\n",
    "query = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN count(n) AS nodes_count\n",
    "\"\"\"\n",
    "\n",
    "qexec(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "981e138a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Waiting for transfer...\n",
      "Inserted into Neo4j: {'sender': 'user1', 'receiver': 'user2', 'amount': 120.5, 'timestamp': '2026-05-10T10:00:00', 'device_sender': 'devA', 'device_receiver': 'devB', 'title': 'zwrot za obiad'}\n",
      "Inserted into Neo4j: {'sender': 'user3', 'receiver': 'user4', 'amount': 75.0, 'timestamp': '2026-05-09T11:00:00', 'device_sender': 'devC', 'device_receiver': 'devD', 'title': 'oddaje pieniadze'}\n",
      "Inserted into Neo4j: {'sender': 'user5', 'receiver': 'user6', 'amount': 200.0, 'timestamp': '2026-05-08T09:30:00', 'device_sender': 'devE', 'device_receiver': 'devF', 'title': 'zwrot kosztow'}\n",
      "Inserted into Neo4j: {'sender': 'user2', 'receiver': 'user1', 'amount': 50.0, 'timestamp': '2026-05-07T14:00:00', 'device_sender': 'devB', 'device_receiver': 'devA', 'title': 'zwrot za paliwo'}\n",
      "Inserted into Neo4j: {'sender': 'user7', 'receiver': 'user8', 'amount': 300.0, 'timestamp': '2026-05-06T16:00:00', 'device_sender': 'devG', 'device_receiver': 'devH', 'title': 'oddaje dlug'}\n",
      "Inserted into Neo4j: {'sender': 'user9', 'receiver': 'user10', 'amount': 20.0, 'timestamp': '2026-05-10T12:00:00', 'device_sender': 'shared1', 'device_receiver': 'devX', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user11', 'receiver': 'user12', 'amount': 35.0, 'timestamp': '2026-05-09T13:00:00', 'device_sender': 'shared1', 'device_receiver': 'devY', 'title': 'rachunek'}\n",
      "Inserted into Neo4j: {'sender': 'user13', 'receiver': 'user14', 'amount': 60.0, 'timestamp': '2026-05-08T15:00:00', 'device_sender': 'shared1', 'device_receiver': 'devZ', 'title': 'przelew'}\n",
      "Inserted into Neo4j: {'sender': 'user15', 'receiver': 'user16', 'amount': 80.0, 'timestamp': '2026-05-10T09:00:00', 'device_sender': 'shared2', 'device_receiver': 'devA', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user17', 'receiver': 'user18', 'amount': 90.0, 'timestamp': '2026-05-09T10:00:00', 'device_sender': 'shared2', 'device_receiver': 'devB', 'title': 'rachunek'}\n",
      "Inserted into Neo4j: {'sender': 'user1', 'receiver': 'user3', 'amount': 45.0, 'timestamp': '2026-05-05T10:00:00', 'device_sender': 'devA', 'device_receiver': 'devC', 'title': 'pizza'}\n",
      "Inserted into Neo4j: {'sender': 'user2', 'receiver': 'user4', 'amount': 55.0, 'timestamp': '2026-05-04T11:00:00', 'device_sender': 'devB', 'device_receiver': 'devD', 'title': 'kino'}\n",
      "Inserted into Neo4j: {'sender': 'user3', 'receiver': 'user5', 'amount': 65.0, 'timestamp': '2026-05-03T12:00:00', 'device_sender': 'devC', 'device_receiver': 'devE', 'title': 'prezent'}\n",
      "Inserted into Neo4j: {'sender': 'user4', 'receiver': 'user6', 'amount': 75.0, 'timestamp': '2026-05-02T13:00:00', 'device_sender': 'devD', 'device_receiver': 'devF', 'title': 'rachunki'}\n",
      "Inserted into Neo4j: {'sender': 'user5', 'receiver': 'user7', 'amount': 85.0, 'timestamp': '2026-05-01T14:00:00', 'device_sender': 'devE', 'device_receiver': 'devG', 'title': 'czynsz'}\n",
      "Inserted into Neo4j: {'sender': 'user6', 'receiver': 'user8', 'amount': 95.0, 'timestamp': '2026-05-01T15:00:00', 'device_sender': 'devF', 'device_receiver': 'devH', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user7', 'receiver': 'user9', 'amount': 105.0, 'timestamp': '2026-05-02T16:00:00', 'device_sender': 'devG', 'device_receiver': 'devX', 'title': 'rachunek'}\n",
      "Inserted into Neo4j: {'sender': 'user8', 'receiver': 'user10', 'amount': 115.0, 'timestamp': '2026-05-03T17:00:00', 'device_sender': 'devH', 'device_receiver': 'devY', 'title': 'transport'}\n",
      "Inserted into Neo4j: {'sender': 'user9', 'receiver': 'user11', 'amount': 125.0, 'timestamp': '2026-05-04T18:00:00', 'device_sender': 'devX', 'device_receiver': 'devZ', 'title': 'jedzenie'}\n",
      "Inserted into Neo4j: {'sender': 'user10', 'receiver': 'user12', 'amount': 135.0, 'timestamp': '2026-05-05T19:00:00', 'device_sender': 'devY', 'device_receiver': 'devA', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user11', 'receiver': 'user13', 'amount': 145.0, 'timestamp': '2026-05-06T20:00:00', 'device_sender': 'devZ', 'device_receiver': 'devB', 'title': 'przelew'}\n",
      "Inserted into Neo4j: {'sender': 'user12', 'receiver': 'user14', 'amount': 155.0, 'timestamp': '2026-05-07T21:00:00', 'device_sender': 'devA', 'device_receiver': 'devC', 'title': 'rachunek'}\n",
      "Inserted into Neo4j: {'sender': 'user13', 'receiver': 'user15', 'amount': 165.0, 'timestamp': '2026-05-08T22:00:00', 'device_sender': 'devB', 'device_receiver': 'devD', 'title': 'transport'}\n",
      "Inserted into Neo4j: {'sender': 'user14', 'receiver': 'user16', 'amount': 175.0, 'timestamp': '2026-05-09T23:00:00', 'device_sender': 'devC', 'device_receiver': 'devE', 'title': 'jedzenie'}\n",
      "Inserted into Neo4j: {'sender': 'user15', 'receiver': 'user17', 'amount': 185.0, 'timestamp': '2026-05-10T08:00:00', 'device_sender': 'devD', 'device_receiver': 'devF', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user16', 'receiver': 'user18', 'amount': 195.0, 'timestamp': '2026-05-08T07:00:00', 'device_sender': 'devE', 'device_receiver': 'devG', 'title': 'rachunek'}\n",
      "Inserted into Neo4j: {'sender': 'user17', 'receiver': 'user19', 'amount': 205.0, 'timestamp': '2026-05-07T06:00:00', 'device_sender': 'devF', 'device_receiver': 'devH', 'title': 'transport'}\n",
      "Inserted into Neo4j: {'sender': 'user18', 'receiver': 'user20', 'amount': 215.0, 'timestamp': '2026-05-06T05:00:00', 'device_sender': 'devG', 'device_receiver': 'devX', 'title': 'jedzenie'}\n",
      "Inserted into Neo4j: {'sender': 'user19', 'receiver': 'user1', 'amount': 225.0, 'timestamp': '2026-05-05T04:00:00', 'device_sender': 'devH', 'device_receiver': 'devY', 'title': 'zakupy'}\n",
      "Inserted into Neo4j: {'sender': 'user20', 'receiver': 'user2', 'amount': 235.0, 'timestamp': '2026-05-04T03:00:00', 'device_sender': 'devX', 'device_receiver': 'devZ', 'title': 'rachunek'}\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mKeyboardInterrupt\u001b[39m                         Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[7]\u001b[39m\u001b[32m, line 31\u001b[39m\n\u001b[32m     27\u001b[39m             session.execute_write(save, data)\n\u001b[32m     28\u001b[39m             print(f\"Inserted into Neo4j: {data}\")\n\u001b[32m     29\u001b[39m \n\u001b[32m     30\u001b[39m \u001b[38;5;28;01mfinally\u001b[39;00m:\n\u001b[32m---> \u001b[39m\u001b[32m31\u001b[39m     driver.close()\n\u001b[32m     32\u001b[39m \n\u001b[32m     33\u001b[39m print(f\"Inserted into DB: {data}\")\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/consumer/group.py:1213\u001b[39m, in \u001b[36mKafkaConsumer.__next__\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m   1211\u001b[39m     \u001b[38;5;28mself\u001b[39m._iterator = \u001b[38;5;28mself\u001b[39m._message_generator_v2()\n\u001b[32m   1212\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m-> \u001b[39m\u001b[32m1213\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[30;43mnext\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_iterator\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m   1214\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mStopIteration\u001b[39;00m:\n\u001b[32m   1215\u001b[39m     \u001b[38;5;28mself\u001b[39m._iterator = \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/consumer/group.py:1185\u001b[39m, in \u001b[36mKafkaConsumer._message_generator_v2\u001b[39m\u001b[34m(self)\u001b[39m\n\u001b[32m   1183\u001b[39m \u001b[38;5;28;01mdef\u001b[39;00m\u001b[38;5;250m \u001b[39m\u001b[34m_message_generator_v2\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[32m   1184\u001b[39m     timeout_ms = \u001b[32m1000\u001b[39m * \u001b[38;5;28mmax\u001b[39m(\u001b[32m0\u001b[39m, \u001b[38;5;28mself\u001b[39m._consumer_timeout - time.time())\n\u001b[32m-> \u001b[39m\u001b[32m1185\u001b[39m     record_map = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mpoll\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimeout_ms\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mtimeout_ms\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mupdate_offsets\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43;01mFalse\u001b[39;49;00m\u001b[30;43m)\u001b[39;49m\n\u001b[32m   1186\u001b[39m     \u001b[38;5;28;01mfor\u001b[39;00m tp, records \u001b[38;5;129;01min\u001b[39;00m six.iteritems(record_map):\n\u001b[32m   1187\u001b[39m         \u001b[38;5;66;03m# Generators are stateful, and it is possible that the tp / records\u001b[39;00m\n\u001b[32m   1188\u001b[39m         \u001b[38;5;66;03m# here may become stale during iteration -- i.e., we seek to a\u001b[39;00m\n\u001b[32m   1189\u001b[39m         \u001b[38;5;66;03m# different offset, pause consumption, or lose assignment.\u001b[39;00m\n\u001b[32m   1190\u001b[39m         \u001b[38;5;28;01mfor\u001b[39;00m record \u001b[38;5;129;01min\u001b[39;00m records:\n\u001b[32m   1191\u001b[39m             \u001b[38;5;66;03m# is_fetchable(tp) should handle assignment changes and offset\u001b[39;00m\n\u001b[32m   1192\u001b[39m             \u001b[38;5;66;03m# resets; for all other changes (e.g., seeks) we'll rely on the\u001b[39;00m\n\u001b[32m   1193\u001b[39m             \u001b[38;5;66;03m# outer function destroying the existing iterator/generator\u001b[39;00m\n\u001b[32m   1194\u001b[39m             \u001b[38;5;66;03m# via self._iterator = None\u001b[39;00m\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/consumer/group.py:708\u001b[39m, in \u001b[36mKafkaConsumer.poll\u001b[39m\u001b[34m(self, timeout_ms, max_records, update_offsets)\u001b[39m\n\u001b[32m    706\u001b[39m timer = Timer(timeout_ms)\n\u001b[32m    707\u001b[39m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m \u001b[38;5;28mself\u001b[39m._closed:\n\u001b[32m--> \u001b[39m\u001b[32m708\u001b[39m     records = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_poll_once\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimer\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mmax_records\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mupdate_offsets\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mupdate_offsets\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    709\u001b[39m     \u001b[38;5;28;01mif\u001b[39;00m records:\n\u001b[32m    710\u001b[39m         \u001b[38;5;28;01mreturn\u001b[39;00m records\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/consumer/group.py:757\u001b[39m, in \u001b[36mKafkaConsumer._poll_once\u001b[39m\u001b[34m(self, timer, max_records, update_offsets)\u001b[39m\n\u001b[32m    754\u001b[39m     log.debug(\u001b[33m'\u001b[39m\u001b[33mpoll: do not have all fetch positions...\u001b[39m\u001b[33m'\u001b[39m)\n\u001b[32m    755\u001b[39m     poll_timeout_ms = \u001b[38;5;28mmin\u001b[39m(poll_timeout_ms, \u001b[38;5;28mself\u001b[39m.config[\u001b[33m'\u001b[39m\u001b[33mretry_backoff_ms\u001b[39m\u001b[33m'\u001b[39m])\n\u001b[32m--> \u001b[39m\u001b[32m757\u001b[39m \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_client\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mpoll\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimeout_ms\u001b[39;49m\u001b[30;43m=\u001b[39;49m\u001b[30;43mpoll_timeout_ms\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    758\u001b[39m \u001b[38;5;66;03m# after the long poll, we should check whether the group needs to rebalance\u001b[39;00m\n\u001b[32m    759\u001b[39m \u001b[38;5;66;03m# prior to returning data so that the group can stabilize faster\u001b[39;00m\n\u001b[32m    760\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._coordinator.need_rejoin():\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/client_async.py:685\u001b[39m, in \u001b[36mKafkaClient.poll\u001b[39m\u001b[34m(self, timeout_ms, future)\u001b[39m\n\u001b[32m    678\u001b[39m         timeout = \u001b[38;5;28mmin\u001b[39m(\n\u001b[32m    679\u001b[39m             user_timeout_ms,\n\u001b[32m    680\u001b[39m             metadata_timeout_ms,\n\u001b[32m    681\u001b[39m             idle_connection_timeout_ms,\n\u001b[32m    682\u001b[39m             request_timeout_ms)\n\u001b[32m    683\u001b[39m         timeout = \u001b[38;5;28mmax\u001b[39m(\u001b[32m0\u001b[39m, timeout)  \u001b[38;5;66;03m# avoid negative timeouts\u001b[39;00m\n\u001b[32m--> \u001b[39m\u001b[32m685\u001b[39m     \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_poll\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m/\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43m1000\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    687\u001b[39m \u001b[38;5;66;03m# called without the lock to avoid deadlock potential\u001b[39;00m\n\u001b[32m    688\u001b[39m \u001b[38;5;66;03m# if handlers need to acquire locks\u001b[39;00m\n\u001b[32m    689\u001b[39m responses.extend(\u001b[38;5;28mself\u001b[39m._fire_pending_completed_requests())\n",
      "\u001b[36mFile \u001b[39m\u001b[32m~/nosql_venv/lib/python3.13/site-packages/kafka/client_async.py:728\u001b[39m, in \u001b[36mKafkaClient._poll\u001b[39m\u001b[34m(self, timeout)\u001b[39m\n\u001b[32m    725\u001b[39m \u001b[38;5;28mself\u001b[39m._register_send_sockets()\n\u001b[32m    727\u001b[39m start_select = time.time()\n\u001b[32m--> \u001b[39m\u001b[32m728\u001b[39m ready = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_selector\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mselect\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    729\u001b[39m end_select = time.time()\n\u001b[32m    730\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m._sensors:\n",
      "\u001b[36mFile \u001b[39m\u001b[32m/usr/lib/python3.13/selectors.py:452\u001b[39m, in \u001b[36mEpollSelector.select\u001b[39m\u001b[34m(self, timeout)\u001b[39m\n\u001b[32m    450\u001b[39m ready = []\n\u001b[32m    451\u001b[39m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[32m--> \u001b[39m\u001b[32m452\u001b[39m     fd_event_list = \u001b[30;43mself\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43m_selector\u001b[39;49m\u001b[30;43m.\u001b[39;49m\u001b[30;43mpoll\u001b[39;49m\u001b[30;43m(\u001b[39;49m\u001b[30;43mtimeout\u001b[39;49m\u001b[30;43m,\u001b[39;49m\u001b[30;43m \u001b[39;49m\u001b[30;43mmax_ev\u001b[39;49m\u001b[30;43m)\u001b[39;49m\n\u001b[32m    453\u001b[39m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mInterruptedError\u001b[39;00m:\n\u001b[32m    454\u001b[39m     \u001b[38;5;28;01mreturn\u001b[39;00m ready\n",
      "\u001b[31mKeyboardInterrupt\u001b[39m: "
     ]
    }
   ],
   "source": [
    "print(f\"Waiting for transfer...\")\n",
    "\n",
    "driver = GraphDatabase.driver(URI, auth=(USERNAME, PASSWORD))\n",
    "def save(tx, data):\n",
    "    query = \"\"\"\n",
    "    MERGE(sender:User {id:$sender, role:'sender'})\n",
    "    MERGE(receiver:User {id:$receiver, role:'receiver'})\n",
    "\n",
    "    MERGE(device_sender:Device {id:$device_sender})\n",
    "    MERGE(device_receiver:Device {id:$device_receiver})\n",
    "\n",
    "    MERGE (sender)-[:USES {timestamp: datetime($timestamp)}]->(device_sender)\n",
    "    MERGE (receiver)-[:USES {timestamp: datetime($timestamp)}]->(device_receiver)\n",
    "\n",
    "    CREATE (sender)-[:TRANSFER {\n",
    "        amount: $amount,\n",
    "        timestamp: datetime($timestamp),\n",
    "        title: $title\n",
    "    }]->(receiver)\n",
    "    \"\"\"\n",
    "    tx.run(query, **data)\n",
    "\n",
    "try:\n",
    "    with driver.session() as session:\n",
    "        for msg in consumer:\n",
    "            data = msg.value\n",
    "            session.execute_write(save, data)\n",
    "            print(f\"Inserted into Neo4j: {data}\")\n",
    "\n",
    "finally:\n",
    "    driver.close()\n",
    "\n",
    "print(f\"Inserted into DB: {data}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "42cf0813",
   "metadata": {},
   "source": [
    "# 6. Zapytania sprawdzające:\n",
    "b) (Cypher) Znajdź użytkowników korzystających z tego samego urządzenia w ciągu\n",
    "ostatnich 20 dni."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c895f2cc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>user1</th>\n",
       "      <th>user2</th>\n",
       "      <th>device</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>user1</td>\n",
       "      <td>user12</td>\n",
       "      <td>devA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>user12</td>\n",
       "      <td>user16</td>\n",
       "      <td>devA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>user1</td>\n",
       "      <td>user16</td>\n",
       "      <td>devA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>user13</td>\n",
       "      <td>user18</td>\n",
       "      <td>devB</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>user13</td>\n",
       "      <td>user2</td>\n",
       "      <td>devB</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>user18</td>\n",
       "      <td>user2</td>\n",
       "      <td>devB</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>user14</td>\n",
       "      <td>user3</td>\n",
       "      <td>devC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>user15</td>\n",
       "      <td>user4</td>\n",
       "      <td>devD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>user16</td>\n",
       "      <td>user5</td>\n",
       "      <td>devE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>user17</td>\n",
       "      <td>user6</td>\n",
       "      <td>devF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>user18</td>\n",
       "      <td>user7</td>\n",
       "      <td>devG</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>user19</td>\n",
       "      <td>user8</td>\n",
       "      <td>devH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>user11</td>\n",
       "      <td>user13</td>\n",
       "      <td>shared1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>user13</td>\n",
       "      <td>user9</td>\n",
       "      <td>shared1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>user11</td>\n",
       "      <td>user9</td>\n",
       "      <td>shared1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>user10</td>\n",
       "      <td>user20</td>\n",
       "      <td>devX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>user20</td>\n",
       "      <td>user9</td>\n",
       "      <td>devX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>user10</td>\n",
       "      <td>user9</td>\n",
       "      <td>devX</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>user1</td>\n",
       "      <td>user10</td>\n",
       "      <td>devY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>user1</td>\n",
       "      <td>user12</td>\n",
       "      <td>devY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>user10</td>\n",
       "      <td>user12</td>\n",
       "      <td>devY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>user11</td>\n",
       "      <td>user14</td>\n",
       "      <td>devZ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>user15</td>\n",
       "      <td>user17</td>\n",
       "      <td>shared2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     user1   user2   device\n",
       "0    user1  user12     devA\n",
       "1   user12  user16     devA\n",
       "2    user1  user16     devA\n",
       "3   user13  user18     devB\n",
       "4   user13   user2     devB\n",
       "5   user18   user2     devB\n",
       "6   user14   user3     devC\n",
       "7   user15   user4     devD\n",
       "8   user16   user5     devE\n",
       "9   user17   user6     devF\n",
       "10  user18   user7     devG\n",
       "11  user19   user8     devH\n",
       "12  user11  user13  shared1\n",
       "13  user13   user9  shared1\n",
       "14  user11   user9  shared1\n",
       "15  user10  user20     devX\n",
       "16  user20   user9     devX\n",
       "17  user10   user9     devX\n",
       "18   user1  user10     devY\n",
       "19   user1  user12     devY\n",
       "20  user10  user12     devY\n",
       "21  user11  user14     devZ\n",
       "22  user15  user17  shared2"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#b) (Cypher) Znajdź użytkowników korzystających z tego samego urządzenia w ciągu\n",
    "#ostatnich 3 dni. \n",
    "# UWAGA - zmiana na 20 dni bo 3 dni wyjechalo poza okienko :) i byl brak wynikow\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u1:User)-[uses1:USES]->(d:Device)<-[uses2:USES]-(u2:User)\n",
    "WHERE u1.id < u2.id\n",
    "  AND uses1.timestamp >= datetime() - duration({days: 20})\n",
    "  AND uses2.timestamp >= datetime() - duration({days: 20})\n",
    "RETURN DISTINCT u1.id as user1, u2.id as user2, d.id as device;\n",
    "\"\"\"\n",
    "\n",
    "qexec(query)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "nosql_venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
